import numpy as np

# ==========================================
# FUNÇÃO 1: BOOTH
# ==========================================
def f1(x):
    return (x[0] + 2*x[1] - 7)**2 + (2*x[0] + x[1] - 5)**2

def grad1(x):
    return np.array([10*x[0] + 8*x[1] - 34, 8*x[0] + 10*x[1] - 38])

def hess1(x):
    return np.array([[10.0, 8.0], [8.0, 10.0]])


# ==========================================
# FUNÇÃO 2: THREE-HUMP CAMEL
# ==========================================
def f4(x):
    return 2*(x[0]**2) - 1.05*(x[0]**4) + (x[0]**6)/6 + x[0]*x[1] + (x[1]**2)

def grad4(x):
    return np.array([4*x[0] - 4.2*(x[0]**3) + (x[0]**5) + x[1],
                     x[0] + 2*x[1]])

def hess4(x):
    return np.array([[4 - 12.6*(x[0]**2) + 5*(x[0]**4), 1.0],
                     [1.0, 2.0]])


# ==========================================
# FUNÇÃO 3: ROSENBROCK
# ==========================================
def f_rosenbrock(x):
    return 100 * (x[1] - x[0]**2)**2 + (1 - x[0])**2

def grad_rosenbrock(x):
    return np.array([
        -400 * x[0] * (x[1] - x[0]**2) - 2 * (1 - x[0]),
         200 * (x[1] - x[0]**2)
    ])

def hess_rosenbrock(x):
    return np.array([
        [-400 * (x[1] - 3 * x[0]**2) + 2.0, -400 * x[0]],
        [-400 * x[0],                          200.0]
    ])


# ==========================================
# FUNÇÃO 4: DIXON-PRICE 
# ==========================================
def f_dixon(x):
    return (x[0] - 1)**2 + 2 * (2*x[1]**2 - x[0])**2

def grad_dixon(x):
    df_dx1 = 2*(x[0] - 1) + 2 * 2*(2*x[1]**2 - x[0])*(-1)
    df_dx2 = 2 * 2*(2*x[1]**2 - x[0]) * 4*x[1]
    return np.array([df_dx1, df_dx2])

def hess_dixon(x):
    H00 = 6.0
    H01 = -16.0 * x[1]
    H11 = 16.0*(2*x[1]**2 - x[0]) + 64.0*x[1]**2
    return np.array([[H00, H01], [H01, H11]])


# ==========================================
# FUNÇÃO PROBLEMA A
# ==========================================
def f_problema_a(x):
    return ((x[0] - 65.2)**2) / 4 + ((x[1] - 60.8)**2) / 9 + 150

def grad_problema_a(x):
    return np.array([(x[0] - 65.2) / 2, (x[1] - 60.8) * 2 / 9])

def hess_problema_a(x):
    return np.array([[0.5, 0.0], [0.0, 2/9]])